{
  "Machine Learning": "Машинное обучение — это класс методов искусственного интеллекта, характерной чертой которых является не прямое решение задачи, а обучение в процессе применения решений множества сходных задач.",
  "Нейронная сеть": "Нейронная сеть — это математическая модель, а также её программное или аппаратное воплощенипие, построенная по принцу организации и функционирования биологических нейронных сетей — сетей нервных клеток живого организма.",
  "Big Data": "Большие данные — это совокупность подходов, инструментов и методов обработки структурированных и неструктурированных данных огромных объёмов и значительного многообразия для получения воспринимаемых человеком результатов.",
  "Overfitting": "Переобучение (Overfitting) — это явление в машинном обучении, когда модель слишком хорошо подгоняется под обучающие данные, включая шум, и в результате плохо обобщается на новые, невидимые данные.",
  "Pandas": "Pandas — это популярная библиотека Python для анализа данных. Она предоставляет высокопроизводительные, простые в использовании структуры данных и инструменты анализа данных.",
  "Underfitting": "Недообучение (Underfitting) — это ситуация, когда модель слишком проста и не способна уловить основные закономерности в данных, что приводит к низкой точности как на обучающей, так и на тестовой выборке.",
  "NumPy": "NumPy (Numerical Python) — это фундаментальная библиотека для научных вычислений в Python. Она предоставляет поддержку больших, многомерных массивов и матриц, а также набор математических функций для работы с ними.",
  "Scikit-learn": "Scikit-learn — это одна из самых популярных библиотек машинного обучения для Python. Она содержит простые и эффективные инструменты для анализа данных и моделирования, включая алгоритмы классификации, регрессии, кластеризации и многое другое.",
  "TensorFlow": "TensorFlow — это открытая платформа для машинного обучения, разработанная Google. Она широко используется для построения и обучения глубоких нейронных сетей.",
  "PyTorch": "PyTorch — это открытая библиотека машинного обучения на основе Torch, разработанная исследовательской группой Facebook AI. Она известна своей гибкостью и широко используется в научных исследованиях.",
  "Feature Engineering": "Инжиниринг признаков (Feature Engineering) — это процесс использования знаний о данных для создания новых признаков (фичей), которые помогают алгоритмам машинного обучения работать лучше. Это один из самых креативных и важных этапов в DS.",
  "Классификация": "Классификация (Classification) — это задача машинного обучения, в которой алгоритм должен отнести объект к одному из заранее известных классов. Например, определить, является ли письмо спамом или не спамом.",
  "Регрессия": "Регрессия (Regression) — это задача машинного обучения, в которой алгоритм должен предсказать непрерывное числовое значение. Например, предсказать цену дома или температуру на завтра.",
  "Кластеризация": "Кластеризация (Clustering) — это задача обучения без учителя, в которой алгоритм должен сгруппировать схожие объекты вместе, не имея заранее известных меток классов. Например, сгруппировать клиентов по покупательскому поведению.",
  "Dataframe": "DataFrame (Датафрейм) — это основная двумерная структура данных в библиотеке Pandas, похожая на таблицу в Excel или SQL. Состоит из строк и именованных столбцов, и позволяет удобно хранить и обрабатывать данные разных типов.",
  "SQL": "SQL (Structured Query Language) — это язык структурированных запросов, используемый для общения с базами данных. Специалисты по данным используют SQL для извлечения, фильтрации и агрегации данных перед анализом.",
  "Web Scraping": "Веб-скрапинг — это процесс автоматического сбора данных с веб-сайтов. Часто используется для получения данных, которые не доступны через API. Помните: скрапьте вежливо и этично!",
  "API": "API (Application Programming Interface) — это программный интерфейс приложения, набор правил и инструментов, по которым одна программа может взаимодействовать с другой. Это как меню в ресторане: вы заказываете блюдо (данные), не зная, как именно его готовят на кухне.",
  "ETL": "ETL (Extract, Transform, Load) — это процесс извлечения данных из одного или нескольких источников, их преобразования (очистки, обогащения) и загрузки в целевое хранилище, например, в базу данных или хранилище данных (DWH).",
  "A/B-тестирование": "A/B-тестирование — это метод маркетингового исследования, суть которого заключается в том, что контрольная группа элементов сравнивается с набором тестовых групп, в которых один или несколько показателей были изменены, для того, чтобы выяснить, какие из изменений улучшают целевой показатель.",
  "Проклятие размерности": "Проклятие размерности (Curse of Dimensionality) — это мемное, но реальное явление, когда при увеличении количества признаков (размерности) данные становятся очень разреженными, а эффективность многих алгоритмов резко падает. Данных как бы много, но они все 'далеко' друг от друга.",
  "Jupyter Notebook": "Jupyter Notebook — это интерактивная среда для вычислений, которая позволяет создавать и делиться документами, содержащими живой код, уравнения, визуализации и текст. Лучший друг дата-сайентиста для исследований.",
  "EDA": "EDA (Exploratory Data Analysis) — разведочный анализ данных. Это первый и важнейший этап любого DS-проекта, на котором исследователь 'знакомится' с данными: строит графики, ищет аномалии, проверяет гипотезы и пытается понять структуру данных. Часто это просто 'потыкать в данные палочкой'."
}

